
<a href='https://sites.google.com/site/jahangirypedram/'> <img src="logo.jpg" /></a>
___
## Pedram Jahangiry 

# Introduction to Pandas

Topics to be covered:

1. Series
2. DataFrames
3. Missing Variables
4. Operations
5. Data import and export

Make sure you have access to the pandas cheatsheet provided in the course folder.

## 1. Series

Series are very similar to NumPy arrays. The difference is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. We can convert a list,numpy array, or dictionary to a Series.

In [3]:
import numpy as np
import pandas as pd

In [4]:
my_list = [1,2,3]
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [6]:
['a','b','c']

['a', 'b', 'c']

In [9]:
'a b c'.split()

['a', 'b', 'c']

In [5]:
labels = ['a','b','c']
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [4]:
my_array = np.array([1,2,3])
pd.Series(my_array)

0    1
1    2
2    3
dtype: int32

In [5]:
pd.Series(my_array,labels)

a    1
b    2
c    3
dtype: int32

In [6]:
my_dict = {'a':1,'b':2,'c':3}
pd.Series(my_dict)

a    1
b    2
c    3
dtype: int64

In [7]:
my_series = pd.Series(my_dict)

In [8]:
my_series[0]         # unlike dictionaries, we can extract info by index number and lable.

1

In [9]:
my_series['b']

2

## 2. DataFrames

DataFrames are directly inspired by the R programming language and are the workhorse of pandas.

In [10]:
np.random.seed(100)  # do this if you want to see the same results as mine

In [10]:
df = pd.DataFrame(np.random.randn(4,4),index='A B C D'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.362240 -1.533715 -0.274753 -0.778500
B -0.088481 -0.747170  0.244135 -0.173707
C -0.001615  1.432244  1.104330  0.476349
D -0.656079  1.053059  1.232406  1.160544

In [11]:
df.describe()

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean   0.154016  0.051104  0.576529  0.171172
std    0.856171  1.421309  0.717383  0.835226
min   -0.656079 -1.533715 -0.274753 -0.778500
25%   -0.230381 -0.943807  0.114413 -0.324905
50%   -0.045048  0.152944  0.674232  0.151321
75%    0.339349  1.147855  1.136349  0.647398
max    1.362240  1.432244  1.232406  1.160544

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 4 columns):
W    4 non-null float64
X    4 non-null float64
Y    4 non-null float64
Z    4 non-null float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [13]:
df.describe().transpose()              # or equivalently, df.describe().T

   count      mean       std       min       25%       50%       75%       max
W    4.0 -0.385384  1.126511 -1.749765 -0.875138 -0.386545  0.103208  0.981321
X    4.0  0.482187  0.247722  0.255001  0.320761  0.428450  0.589876  0.816847
Y    4.0  0.397227  0.685467 -0.458027  0.051378  0.446950  0.792800  1.153036
Z    4.0 -0.247932  0.622657 -1.070043 -0.456838 -0.178424  0.030483  0.435163

### Indexing and extraction

In [15]:
df['W']       # this is equivalent to df.W (which I don't recommend you to use it). == df$W in R

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
Name: W, dtype: float64

In [16]:
df[['W']]

          W
A -1.749765
B  0.981321
C -0.189496
D -0.583595

In [17]:
df[['W','Y']]

          W         Y
A -1.749765  1.153036
B  0.981321  0.221180
C -0.189496 -0.458027
D -0.583595  0.672721

In [18]:
df['new'] = df['W'] + df['Y']

In [19]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [20]:
df.drop('A',axis=0)

          W         X         Y         Z       new
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [21]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [22]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [23]:
df.drop('new',axis=1,inplace=True)    
# or alternatively use: df = df.drop('new', 1)

In [24]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [31]:
# we can select a row by calling its label or by selecting based on its position instead of label 
df.loc['A']

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [26]:
df.iloc[0]

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [28]:
df.iloc[np.arange(3)]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163

In [29]:
df.loc[['A','D'],['W','Z']]

          W         Z
A -1.749765 -0.252436
D -0.583595 -0.104411

### Conditional extraction
This is very similar to numpy conditional extraction

In [61]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [62]:
df>0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False

In [63]:
df[df>0]

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN

In [68]:
df[df['Y']>0]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411

In [69]:
df[df['Y']>0]['X']

A    0.342680
B    0.514219
D    0.816847
Name: X, dtype: float64

In [71]:
df[df['Y']>0][['Y','Z']]

          Y         Z
A  1.153036 -0.252436
B  0.221180 -1.070043
D  0.672721 -0.104411

In [72]:
df[(df['Y']>0) & (df['Z'] < -0.5)]

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

## 3. Missing variables

In [32]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [34]:
df.dropna() # by default axis=0,   # this is similar to df[complete.cases(df),] in R

     A    B  C
0  1.0  5.0  1

In [35]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [36]:
df.dropna(thresh=2) # how many elements in an observation is NaN?

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [38]:
df.fillna('new value')

           A          B  C
0          1          5  1
1          2  new value  2
2  new value  new value  3

In [39]:
df['A'].fillna(value=df['A'].mean()) # filling the value with the mean of a column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64


## 4. Operations

In [59]:
df = pd.DataFrame({'names': 'PJ PJ TJ MJ'.split() ,
                   'GPA': [4,4,3.8,3.5]}, index='A B C D'.split())
df

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8
D    MJ  3.5

In [60]:
df.head(3)

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8

In [61]:
df.tail(1)

  names  GPA
D    MJ  3.5

In [62]:
# Unique Values
df['names'].unique()

array(['PJ', 'TJ', 'MJ'], dtype=object)

In [63]:
# number of unique values
df['GPA'].nunique()

3

In [64]:
df['names'].value_counts()     # this is table(df$names) in R

PJ    2
TJ    1
MJ    1
Name: names, dtype: int64

In [65]:
# Applying Functions
df['GPA'].mean()

3.825

In [66]:
round(df['GPA'].std(), 2)

0.24

In [67]:
df['GPA_100'] = df['GPA'].apply(lambda x: x*25)   # of ocurse we are looking for some special functions not just *25
df

  names  GPA  GPA_100
A    PJ  4.0    100.0
B    PJ  4.0    100.0
C    TJ  3.8     95.0
D    MJ  3.5     87.5

In [68]:
df['is_pass'] = ['pass' if x > 3.5 else 'fail' for x in df['GPA']]    
# in R: df <- mutate(df,is_pass = ifelse(GPA>3.5, "pass", "fail"))
df

  names  GPA  GPA_100 is_pass
A    PJ  4.0    100.0    pass
B    PJ  4.0    100.0    pass
C    TJ  3.8     95.0    pass
D    MJ  3.5     87.5    fail

In [69]:
df.columns            # names(df) in R

Index(['names', 'GPA', 'GPA_100', 'is_pass'], dtype='object')

In [70]:
df.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [71]:
df.sort_values(by='GPA') #inplace=False by default (what does this mean?)

  names  GPA  GPA_100 is_pass
D    MJ  3.5     87.5    fail
C    TJ  3.8     95.0    pass
A    PJ  4.0    100.0    pass
B    PJ  4.0    100.0    pass

In [72]:
df.reset_index(inplace=True)

In [73]:
df

  index names  GPA  GPA_100 is_pass
0     A    PJ  4.0    100.0    pass
1     B    PJ  4.0    100.0    pass
2     C    TJ  3.8     95.0    pass
3     D    MJ  3.5     87.5    fail

## 5. Data import and export

In [74]:
# reading from CSV file
df = pd.read_csv('GDP.csv')   # reading excel files: pd.read_excel('GDP.xlsx',sheetname='Sheet1')
df.tail(5)

           DATE        GDP
285  2018-04-01  20510.177
286  2018-07-01  20749.752
287  2018-10-01  20897.804
288  2019-01-01  21098.827
289  2019-04-01  21339.121

In [196]:
# Writing to CSV file
df.to_csv('GDP_new.csv',index=False)   # writing to excel files: df.to_excel('GDP.xlsx',sheet_name='raw data')

In [198]:
df.to_excel('GDP.xlsx',sheet_name='raw data', index=False)